ChibiOS/ChibiOS/os/hal/ports/STM32/STM32G4xx_ALT/hal_lld.c
  /* PWR clock enabled.*/
  rccEnablePWRInterface(false);

  /* Static PWR configurations.*/
  PWR->CR3   = STM32_PWR_CR3;
  PWR->CR4   = STM32_PWR_CR4;
  PWR->PUCRA = STM32_PWR_PUCRA;
  PWR->PDCRA = STM32_PWR_PDCRA;
  PWR->PUCRB = STM32_PWR_PUCRB;
  PWR->PDCRB = STM32_PWR_PDCRB;
  PWR->PUCRC = STM32_PWR_PUCRC;
  PWR->PDCRC = STM32_PWR_PDCRC;
#if STM32_HAS_GPIOD
  PWR->PUCRD = STM32_PWR_PUCRD;
  PWR->PDCRD = STM32_PWR_PDCRD;
#endif
#if STM32_HAS_GPIOE
  PWR->PUCRE = STM32_PWR_PUCRE;
  PWR->PDCRE = STM32_PWR_PDCRE;
#endif
#if STM32_HAS_GPIOF
  PWR->PUCRF = STM32_PWR_PUCRF;
  PWR->PDCRF = STM32_PWR_PDCRF;
#endif
#if STM32_HAS_GPIOG
  PWR->PUCRG = STM32_PWR_PUCRG;
  PWR->PDCRG = STM32_PWR_PDCRG;
#endif
#if STM32_HAS_GPIOH
  PWR->PUCRH = STM32_PWR_PUCRH;
  PWR->PDCRH = STM32_PWR_PDCRH;
#endif
#if STM32_HAS_GPIOI
  PWR->PUCRI = STM32_PWR_PUCRI;
  PWR->PDCRI = STM32_PWR_PDCRI;
#endif
}

/**
 * @brief   Initializes static muxes and dividers.
 */
__STATIC_INLINE void hal_lld_set_static_clocks(void) {

  /* Clock-related settings (dividers, MCO etc).*/
  RCC->CFGR   = STM32_MCOPRE | STM32_MCOSEL | STM32_PPRE2 | STM32_PPRE1 |
                STM32_HPRE;

  /* CCIPR registers initialization, note.*/
  RCC->CCIPR  = STM32_ADC345SEL  | STM32_ADC12SEL   | STM32_CLK48SEL   |
                STM32_FDCANSEL   | STM32_I2S23SEL   | STM32_SAI1SEL    |
                STM32_LPTIM1SEL  | STM32_I2C3SEL    | STM32_I2C2SEL    |
                STM32_I2C1SEL    | STM32_LPUART1SEL | STM32_UART5SEL   |
                STM32_UART4SEL   | STM32_USART3SEL  | STM32_USART2SEL  |
                STM32_USART1SEL;
  RCC->CCIPR2 = STM32_QSPISEL    | STM32_I2C4SEL;
}

/**
 * @brief   Switches to a different clock configuration.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The clock switch result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
static bool hal_lld_clock_configure(const halclkcfg_t *ccp) {
  uint32_t cr, wtmask;

  /* Restoring default PWR settings related clocks and sleep modes.*/
  halRegWrite32X(&PWR->CR1, PWR_CR1_VOS_0, true);
  if (halRegWaitAllClear32X(&PWR->SR2,
                            PWR_SR2_VOSF | PWR_SR2_REGLPF,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
    return true;
  }

  /* Making sure HSI16 is activated and in use.*/
  halRegWrite32X(&RCC->CR, STM32_RCC_CR_RESET, true);
  if (halRegWaitAllSet32X(&RCC->CR, RCC_CR_HSIRDY,
                          STM32_HSI_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  halRegWrite32X(&RCC->CFGR, STM32_RCC_CFGR_RESET, true);
  if (halRegWaitMatch32X(&RCC->CFGR,
                         RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_HSI,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* Resetting flash ACR settings to the default value.*/
  flash_set_acr(STM32_FLASH_ACR_RESET);

  /* Resetting all other clock sources and PLLs.*/
  halRegWrite32X(&RCC->CRRCR, STM32_RCC_CRRCR_RESET, true);
  halRegWrite32X(&RCC->CR, STM32_RCC_CR_RESET, true);

  wtmask = RCC_CR_HSERDY;
#if defined(RCC_CR_PLLRDY)
  wtmask |= RCC_CR_PLLRDY;
#endif
  if (wtmask != 0U) {
    if (halRegWaitAllClear32X(&RCC->CR, wtmask,
                              STM32_OSCILLATORS_STARTUP_TIME,
                              NULL)) {
      return true;
    }
  }

#if defined(RCC_CRRCR_HSI48RDY)
  if (halRegWaitAllClear32X(&RCC->CRRCR, RCC_CRRCR_HSI48RDY,
                            STM32_OSCILLATORS_STARTUP_TIME,
                            NULL)) {
    return true;
  }
#endif

  /* Configuring oscillators.*/
  cr = ccp->rcc_cr | RCC_CR_HSION;
#if defined(STM32_HSE_BYPASS)
  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    cr |= RCC_CR_HSEBYP;
  }
#endif

  /* Enabling all required oscillators except PLL.*/
  halRegWrite32X(&RCC->CR, cr & ~RCC_CR_PLLON, true);

  /* Adding to the "wait mask" the status bits of enabled oscillators.*/
  wtmask = RCC_CR_HSIRDY;
  if ((cr & RCC_CR_HSEON) != 0U) {
    wtmask |= RCC_CR_HSERDY;
  }
  if (halRegWaitAllSet32X(&RCC->CR, wtmask,
                          STM32_OSCILLATORS_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  /* HSI48 setup, if required.*/
  halRegWrite32X(&RCC->CRRCR, ccp->rcc_crrcr, true);
#if defined(RCC_CRRCR_HSI48RDY)
  if ((ccp->rcc_crrcr & RCC_CRRCR_HSI48ON) != 0U) {
    if (halRegWaitAllSet32X(&RCC->CRRCR, RCC_CRRCR_HSI48RDY,
                            STM32_HSI48_STARTUP_TIME,
                            NULL)) {
      return true;
    }
  }
#endif

  /* PLL setup and activation.*/
  halRegWrite32X(&RCC->PLLCFGR, ccp->rcc_pllcfgr, true);
  if ((cr & RCC_CR_PLLON) != 0U) {
    halRegWrite32X(&RCC->CR, cr | RCC_CR_PLLON, true);
    if (halRegWaitAllSet32X(&RCC->CR, RCC_CR_PLLRDY,
                            STM32_PLL_STARTUP_TIME,
                            NULL)) {
      return true;
    }
  }

  /* MCO and bus dividers first, SW left untouched for now.*/
  halRegWrite32X(&RCC->CFGR,
                 (RCC->CFGR & RCC_CFGR_SW_Msk) |
                 (ccp->rcc_cfgr & ~RCC_CFGR_SW_Msk),
                 true);

  /* Final flash ACR settings.*/
  flash_set_acr(ccp->flash_acr);

  /* Final PWR modes.*/
  halRegWrite32X(&PWR->CR1, ccp->pwr_cr1, true);
  halRegWrite32X(&PWR->CR2, ccp->pwr_cr2, true);
  halRegWrite32X(&PWR->CR5, ccp->pwr_cr5, true);

  if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_VOSF,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
    return true;
  }

  /* Waiting for the correct regulator state.*/
  if ((ccp->pwr_cr1 & PWR_CR1_LPR) == 0U) {
    /* Main mode selected.*/
    if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_REGLPF,
                              STM32_REGULATORS_TRANSITION_TIME,
                              NULL)) {
      return true;
    }
  }
  else {
    /* Low power mode selected.*/
    if (halRegWaitAllSet32X(&PWR->SR2, PWR_SR2_REGLPF,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
      return true;
    }
  }

  /* Switching to the final clock source.*/
  halRegWrite32X(&RCC->CFGR,
                 (RCC->CFGR & ~RCC_CFGR_SW_Msk) |
                 (ccp->rcc_cfgr & RCC_CFGR_SW_Msk),
                 true);
  if (halRegWaitMatch32X(&RCC->CFGR,
                         RCC_CFGR_SWS_Msk,
                         (ccp->rcc_cfgr & RCC_CFGR_SW_Msk) << RCC_CFGR_SWS_Pos,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* If HSI16 is not in configuration then it is finally shut down.*/
  if ((ccp->rcc_cr & RCC_CR_HSION) == 0U) {
    halRegClear32X(&RCC->CR, RCC_CR_HSION, true);
  }

